"""this file for interested collections"""


"""dict country flags"""
country_flags = {'AF': '🇦🇫', 'AL': '🇦🇱', 'DZ': '🇩🇿', 'AD': '🇦🇩', 'AO': '🇦🇴', 'AG': '🇦🇬',
                 'AR': '🇦🇷', 'AM': '🇦🇲', 'AU': '🇦🇺', 'AT': '🇦🇹', 'AZ': '🇦🇿', 'BS': '🇧🇸',
                 'BH': '🇧🇭', 'BD': '🇧🇩', 'BB': '🇧🇧', 'BY': '🇧🇾', 'BE': '🇧🇪', 'BZ': '🇧🇿',
                 'BJ': '🇧🇯', 'BT': '🇧🇹', 'BO': '🇧🇴', 'BA': '🇧🇦', 'BW': '🇧🇼', 'BR': '🇧🇷',
                 'BN': '🇧🇳', 'BG': '🇧🇬', 'BF': '🇧🇫', 'BI': '🇧🇮', 'CV': '🇨🇻', 'KH': '🇰🇭',
                 'CM': '🇨🇲', 'CA': '🇨🇦', 'CF': '🇨🇫', 'TD': '🇹🇩', 'CL': '🇨🇱', 'CN': '🇨🇳',
                 'CO': '🇨🇴', 'KM': '🇰🇲', 'CG': '🇨🇬', 'CR': '🇨🇷', 'HR': '🇭🇷', 'CU': '🇨🇺',
                 'CY': '🇨🇾', 'CZ': '🇨🇿', 'DK': '🇩🇰', 'DJ': '🇩🇯', 'DM': '🇩🇲', 'DO': '🇩🇴',
                 'EC': '🇪🇨', 'EG': '🇪🇬', 'SV': '🇸🇻', 'GQ': '🇬🇶', 'ER': '🇪🇷', 'EE': '🇪🇪',
                 'ET': '🇪🇹', 'FJ': '🇫🇯', 'FI': '🇫🇮', 'FR': '🇫🇷', 'GA': '🇬🇦', 'GM': '🇬🇲',
                 'GE': '🇬🇪', 'DE': '🇩🇪', 'GH': '🇬🇭', 'GR': '🇬🇷', 'GD': '🇬🇩', 'GT': '🇬🇹',
                 'GN': '🇬🇳', 'GW': '🇬🇼', 'GY': '🇬🇾', 'HT': '🇭🇹', 'HN': '🇭🇳', 'HU': '🇭🇺',
                 'IS': '🇮🇸', 'IN': '🇮🇳', 'ID': '🇮🇩', 'IR': '🇮🇷', 'IQ': '🇮🇶', 'IE': '🇮🇪',
                 'IL': '🇮🇱', 'IT': '🇮🇹', 'CI': '🇨🇮', 'JM': '🇯🇲', 'JP': '🇯🇵', 'JO': '🇯🇴',
                 'KZ': '🇰🇿', 'KE': '🇰🇪', 'KI': '🇰🇮', 'KW': '🇰🇼', 'KG': '🇰🇬', 'LA': '🇱🇦',
                 'LV': '🇱🇻', 'LB': '🇱🇧', 'LS': '🇱🇸', 'LR': '🇱🇷', 'LY': '🇱🇾', 'LI': '🇱🇮',
                 'LT': '🇱🇹', 'LU': '🇱🇺', 'MK': '🇲🇰', 'MG': '🇲🇬', 'MW': '🇲🇼', 'MY': '🇲🇾',
                 'MV': '🇲🇻', 'ML': '🇲🇱', 'MT': '🇲🇹', 'MH': '🇲🇭', 'MR': '🇲🇷', 'MU': '🇲🇺',
                 'MX': '🇲🇽', 'FM': '🇫🇲', 'MD': '🇲🇩', 'MC': '🇲🇨', 'MN': '🇲🇳', 'ME': '🇲🇪',
                 'MA': '🇲🇦', 'MZ': '🇲🇿', 'MM': '🇲🇲', 'NA': '🇳🇦', 'NR': '🇳🇷', 'NP': '🇳🇵',
                 'NL': '🇳🇱', 'NZ': '🇳🇿', 'NI': '🇳🇮', 'NE': '🇳🇪', 'NG': '🇳🇬', 'KP': '🇰🇵',
                 'NO': '🇳🇴', 'OM': '🇴🇲', 'PK': '🇵🇰', 'PW': '🇵🇼', 'PA': '🇵🇦', 'PG': '🇵🇬',
                 'PY': '🇵🇾', 'PE': '🇵🇪', 'PH': '🇵🇭', 'PL': '🇵🇱', 'PT': '🇵🇹', 'QA': '🇶🇦',
                 'KR': '🇰🇷', 'RO': '🇷🇴', 'RU': '🇷🇺', 'RW': '🇷🇼', 'KN': '🇰🇳', 'LC': '🇱🇨',
                 'VC': '🇻🇨', 'WS': '🇼🇸', 'SM': '🇸🇲', 'ST': '🇸🇹', 'SA': '🇸🇦', 'SN': '🇸🇳',
                 'RS': '🇷🇸', 'SC': '🇸🇨', 'SL': '🇸🇱', 'SG': '🇸🇬', 'SK': '🇸🇰', 'SI': '🇸🇮',
                 'SB': '🇸🇧', 'SO': '🇸🇴', 'ZA': '🇿🇦', 'SS': '🇸🇸', 'ES': '🇪🇸', 'LK': '🇱🇰',
                 'SD': '🇸🇩', 'SR': '🇸🇷', 'SE': '🇸🇪', 'CH': '🇨🇭', 'SY': '🇸🇾', 'TW': '🇹🇼',
                 'TJ': '🇹🇯', 'TZ': '🇹🇿', 'TH': '🇹🇭', 'TL': '🇹🇱', 'TG': '🇹🇬', 'TO': '🇹🇴',
                 'TT': '🇹🇹', 'TN': '🇹🇳', 'TR': '🇹🇷', 'TM': '🇹🇲', 'TV': '🇹🇻', 'UG': '🇺🇬',
                 'UA': '🇺🇦', 'AE': '🇦🇪', 'GB': '🇬🇧', 'US': '🇺🇸', 'UY': '🇺🇾', 'UZ': '🇺🇿',
                 'VU': '🇻🇺', 'VA': '🇻🇦', 'VE': '🇻🇪', 'VN': '🇻🇳', 'YE': '🇾🇪', 'ZM': '🇿🇲',
                 'ZW': '🇿🇼'}

"""
 'Zen of Python' (Зен Питона) - это коллекция принципов дизайна и философии
 программирования на языке Python. 
 Эти принципы были сформулированы Тимом Петерсом (Tim Peters) и 
 включены в интерпретатор Python. Вы можете получить доступ к ним, 
 выполнив в интерпретаторе Python следующую команду:
"""
the_Zen_of_Python = ['Красивое лучше, чем уродливое.', 'Явное лучше, чем неявное.', 'Простое лучше, чем сложное.',
                     'Сложное лучше, чем запутанное.', 'Плоское лучше, чем вложенное.',
                     'Разреженное лучше, чем плотное.', 'Читаемость имеет значение.',
                     'Особые случаи не настолько особые, чтобы нарушать правила.\n'
                     'При этом практичность важнее безупречности.', 'Ошибки никогда не должны замалчиваться.',
                     'Если они не замалчиваются явно.', 'Встретив двусмысленность, отбрось искушение угадать.',
                     'Должен существовать один и, желательно, только один очевидный способ сделать это.. '
                     'Хотя он поначалу может быть и не очевиден, если вы не голландец.',
                     'Сейчас лучше, чем никогда.\nХотя никогда зачастую лучше, чем прямо сейчас.',
                     'Если реализацию сложно объяснить — идея плоха.',
                     'Если реализацию легко объяснить — идея, возможно, хороша.',
                     'Пространства имён — отличная штука! Будем делать их больше!']

"""humanity's best thoughts for Eastern European countries"""
best_thoughts_west = {
    'Я знаю, что ничего не знаю.':
        {'автор': 'Сократ', 'комментарий': '- Эта фраза отражает скромность в познании и призывает к постоянному стремлению к знанию.'},
    'Человек — животное политическое.':
        {'автор': 'Аристотель', 'комментарий': '- Аристотель подчеркивает важность общественного взаимодействия и участия в политической жизни.'},
    'Мечты не что иное, как реальность, которая ждет своего часа.':
        {'автор': 'Мартин Лютер Кинг', 'комментарий': '- Эта цитата подчеркивает силу мечты и надежды в достижении перемен и справедливости.'},
    'Смелость — это способность смело действовать, несмотря на страх; смелость также в том, чтобы не действовать, когда нет оснований для действия.':
        {'автор': 'Иммануил Кант','комментарий': '- Кант подчеркивает важность смелости и нравственного выбора в действиях человека.'},
    'Будь изменением, которое ты хочешь видеть в мире.':
        {'автор': 'Махатма Ганди', 'комментарий': '- Эта фраза подчеркивает ответственность каждого человека за свои действия и призывает к тому, чтобы начать изменения с самого себя.'},
    'Логика может привести вас от пункта А в пункт Б, но воображение может привести вас куда угодно.':
        {'автор': 'Альберт Эйнштейн','комментарий': '- Эйнштейн подчеркивает творческую силу воображения в науке и жизни.'},
    'Образование — самое мощное оружие, которое вы можете использовать, чтобы изменить мир.':
        {'автор': 'Нельсон Мандела','комментарий': '- Мандела подчеркивает важность образования в борьбе за социальную справедливость и развитие общества.'},
    'То, что не убивает нас, делает нас сильнее.':
        {'автор': 'Фридрих Ницше', 'комментарий': '- Ницше выражает идею роста и укрепления через преодоление трудностей.'},
    'Будьте изменением, которое вы хотите видеть в мире.':
        {'автор': 'Махатма Ганди','комментарий': 'Эта фраза акцентирует силу личного примера в воплощении изменений в обществе.'},
    'Тьма не может вытеснить тьму, только свет может это сделать. Ненависть не может вытеснить ненависть, только любовь может это сделать.':
        {'автор': 'Мартин Лютер Кинг', 'комментарий': 'Кинг призывает к применению любви и света в борьбе за справедливость и преодоление конфликтов.'},
    'Жизнь — это как велосипед. Чтобы сохранить равновесие, ты должен двигаться.':
        {'автор': 'Альберт Эйнштейн','комментарий': 'Эта аналогия подчеркивает важность постоянного развития и движения вперед в жизни.'},
    'Единственное, что мы должны бояться, — это боязнь сама по себе.':
        {'автор': 'Фрэнклин Д. Рузвельт', 'комментарий': 'Рузвельт обращается к важности преодоления страха и принятия вызовов с мужеством.'},
    'Успех — это способность идти от одной неудачи к другой, не теряя энтузиазма.':
        {'автор': 'Уинстон Черчилль', 'комментарий': 'Эта цитата подчеркивает важность упорства и оптимизма в достижении целей.'},
    'Путешествие тысячи миль начинается с одного шага.':
        {'автор': 'Лао Цзы','комментарий': 'Эта фраза подчеркивает важность начала и постоянства в достижении долгосрочных целей.'},
    'Сначала понимай, потом будь понятым.':
        {'автор': 'Стивен Кови', 'комментарий': 'Эта фраза подчеркивает важность эмпатии и коммуникации в межличностных отношениях.'},
    'Неизученная жизнь не стоит того, чтобы ее жить.':
        {'автор': 'Сократ', 'комментарий': 'Сократ подчеркивает важность самопознания и постоянного обучения для полноценной и осмысленной жизни.'},
    'Мы в ответе не только за то, что делаем, но и за то, что не делаем.':
        {'автор': 'Антуан де Сент-Экзюпери', 'комментарий': 'Эта фраза подчеркивает понятие ответственности и активного участия в формировании окружающего мира.'},
    'Судите человека по его вопросам, а не по ответам.':
        {'автор': 'Вольтер', 'комментарий': 'Вольтер призывает к ценности любознательности и поиска знаний в процессе общения и взаимодействия.'},
    'Жизнь интересна лишь тогда, когда смело смотреть в лицо ей.':
        {'автор': 'Хелен Келлер','комментарий': 'Келлер, сама столкнувшаяся с ограничениями, подчеркивает важность отваги и оптимизма в преодолении трудностей.'},
    'Не сильнейшие виды выживают, а те, которые лучше всего адаптировались к изменениям.':
        {'автор': 'Чарльз Дарвин','комментарий': 'Эта идея акцентирует важность гибкости и способности к адаптации в условиях изменчивого окружения.'},
    'Будьте собой, все другие роли уже заняты.':
        {'автор': 'Оскар Уайльд','комментарий': 'Уайльд призывает к аутентичности и самовыражению в обществе, не поддаваясь социальным ожиданиям.'},
    'Иметь свое мнение — это быть одним из народа; иметь свою истину — это быть одним из богов.':
        {'автор': 'Эмили Дикинсон','комментарий': 'Дикинсон подчеркивает ценность индивидуального мышления и поиска собственной истины.'},
    'Опыт — это единственный учитель, у которого занятия дорого.':
        {'автор': 'Леонардо да Винчи','комментарий': 'Да Винчи подчеркивает ценность опыта и уроков, которые мы извлекаем из своих собственных жизненных ситуаций.'},
    'Не следуй за мнением других, пока не сделаешь собственное.':
        {'автор': 'Ральф Уолдо Эмерсон','комментарий': 'Эмерсон призывает к самостоятельному мышлению и формированию собственных убеждений.'},
    'Двадцатилетний парень воспринимает своих родителей как дураков, и через десять лет опять находит, что они дураки.':
        {'автор': 'Марк Твен','комментарий': 'Эта фраза отражает эволюцию взглядов и понимания с возрастом, подчеркивая ценность жизненного опыта.'},
    'Ничто в жизни не следует бояться, а просто понимать.':
        {'автор': 'Мария Кюри','комментарий': 'Кюри призывает к изучению и пониманию мира вместо беспокойства и страха перед неизвестным.'},
    'Никто не сталкивается с трудностью так, как тот, кто не знает, что его ждет.':
        {'автор': 'Анна Франк', 'комментарий': 'Франк выражает силу надежды и оптимизма даже в самых трудных условиях.'},
    'Сначала тебя игнорируют, потом смеются над тобой, затем с тобой борются, и в конце ты побеждаешь.':
        {'автор': 'Ганди', 'комментарий': 'Эта идея подчеркивает процесс принятия новаторских идей и изменений в обществе.'},
    'Тот, кто двигается гора за горой, может начать с маленьких камней.':
        {'автор': 'Конфуций', 'комментарий': 'Конфуций призывает к пошаговому подходу в достижении долгосрочных целей.'},
    'Мы все делаем выбор, но в конечном итоге это наши выборы определяют нас.':
        {'автор': 'Дж.К. Роулинг','комментарий': 'Роулинг акцентирует важность личных решений и их влияния на нашу жизнь.'},
    'Сила не приводит к победе, но сила любви приводит к победе над силой.':
        {'автор': 'Махатма Ганди', 'комментарий': 'Эта мысль подчеркивает силу ненасилия и любви в достижении мирных целей.'},
    'Тот, кто имеет для чего жить, может вынести почти любое как.':
        {'автор': 'Фридрих Ницше','комментарий': 'Ницше выражает важность наличия цели и смысла в жизни в преодолении трудностей.'},
    'Не все из нас могут делать великие вещи, но все из нас могут делать маленькие вещи с великой любовью.':
        {'автор': 'Мать Тереза','комментарий': 'Мать Тереза подчеркивает силу добрых дел и заботы о ближних.'},
    'Логика может привести вас от пункта А в пункт Б. Воображение — куда угодно.':
        {'автор': 'Альберт Эйнштейн','комментарий': 'Эйнштейн подчеркивает важность творческого мышления и воображения в научном исследовании и в жизни в целом.'},
    'Ваше время ограничено, не тратьте его, живя чужой жизнью.':
        {'автор': 'Стив Джобс','комментарий': 'Джобс подчеркивает важность самопознания и следования своим убеждениям.'},
    'Следуй за своим внутренним голосом. Это будет единственный путь, каким вы найдете свою истину.':
        {'автор': 'Эллен ДеДженерес','комментарий': 'ДеДженерес подчеркивает важность аутентичности и слушания собственного внутреннего голоса.'},
    'Самая красивая вещь, которую вы можете надеть, — это уверенность.':
        {'автор': 'Коко Шанель', 'комментарий': 'Шанель подчеркивает важность внутренней уверенности и силы характера.'},
    'Цель жизни — нести счастье другим.':
        {'автор': 'Далай Лама','комментарий': 'Далай Лама выражает идею о смысле жизни через служение и радость приношения счастья другим.'},
    'Мастерство искусства — в том, чтобы знать, как скрыть своё мастерство.':
        {'автор': 'Михаил Булгаков','комментарий': 'Булгаков подчеркивает искусство скромности и тонкости в проявлении своих навыков и талантов.'},
    'Все насущные вопросы непросты. Ответ на любой вопрос — это начало нового вопроса.':
        {'автор': 'Оскар Уайльд','комментарий': 'Уайльд подчеркивает сложность жизни и непрерывный процесс поиска знаний и понимания.'},
    'Большинство людей считают, что страх — это сигнал остановиться, когда на самом деле он призывает двигаться вперед.':
        {'автор': 'Мартина Навратилова','комментарий': 'Навратилова акцентирует важность преодоления страха и использование его в качестве мотивации.'},
    'Вы не можете влиять на те события, которые происходят с вами, но вы можете влиять на свою реакцию на них.':
        {'автор': 'Майя Анжелу','комментарий': 'Эта мысль подчеркивает власть выбора и ответственность за свои реакции на окружающий мир.'},
    'Тот, кто никогда не делает ошибок, ничего не делает.':
        {'автор': 'Джордж Бернард Шоу', 'комментарий': 'Шоу выражает идею, что из ошибок и неудач можно извлечь уроки и расти как личность.'},
    'Береги свое сердце, оставайся мудрым и веселым в этой жизни.':
        {'автор': 'Анна Ахматова','комментарий': 'Ахматова подчеркивает важность бережного обращения с собственным сердцем и поддержания радости жизни.'},
    'Мы отвечаем за тех, кого приручили.':
        {'автор': 'Антуан де Сент-Экзюпери','комментарий': 'Эта фраза подчеркивает ответственность за тех, кого мы призываем в свою жизнь и за кого берем ответственность.'},
    'Я потерпел более 9000 промахов в своей карьере. Я проиграл почти 300 игр. 26 раз мне доверяли сделать решающий бросок, и я промахивался. Я провалился снова и снова в своей жизни. Именно поэтому я добился успеха.':
        {'автор': 'Майкл Джордан','комментарий': 'Джордан подчеркивает важность уроков, извлекаемых из неудач, на пути к успеху.'},
    'Когда ты пытаешься достичь нечто большее, чем обычный успех, ты должен готовиться к большему провалу.':
        {'автор': 'Нельсон Мандела','комментарий': 'Мандела акцентирует важность смелости и готовности к риску в поиске выдающихся результатов.'},
    'Не бойтесь быть отличными.':
        {'автор': 'Рей Брэдбери','комментарий': 'Брэдбери подчеркивает важность уникальности и самовыражения в творчестве и жизни.'},
    'Делайте только то, что правильно, а не то, что просто удобно.':
        {'автор': 'Махатма Ганди','комментарий': 'Ганди призывает к моральным принципам и справедливому поведению в жизни.'},
    'Человек обнаруживает смысл своей жизни не в том, чтобы быть счастливым, а в том, чтобы быть полезным.':
        {'автор': 'Виктор Франкл','комментарий': 'Франкл подчеркивает важность нахождения смысла и цели в служении другим и внесении вклада в общество.'},
    'Жизнь - безграничное путешествие; без конечной цели, без поиска конечного ответа.':
        {'автор': 'Рабиндранат Тагор','комментарий': 'Тагор выражает идею о постоянном познании и росте в течение всей жизни.'},
    'Мы можем бесконечно терпеть боль отдельно взятых, но мы не можем терпеть беспорядка во всем мире.':
        {'автор': 'Мартин Лютер Кинг','комментарий': 'Кинг подчеркивает важность борьбы за справедливость и равенство в обществе.'},
    'Человек не должен быть рабом ни страстей, ни уродливых привычек.':
        {'автор': 'Антон Чехов','комментарий': 'Чехов призывает к освобождению от негативных страстей и привычек, которые могут вредить личному развитию.'},
    'Нельзя дважды войти в одну и ту же реку.':
        {'автор': 'Гераклит','комментарий': 'Эта фраза выражает идею о постоянном изменении и неизбежности времени, требующей адаптации.'},
    'Тот, кто понимает других, знает себя; тот, кто побеждает других, силен; тот, кто побеждает самого себя, могуществен.':
        {'автор': 'Лао Цзы','комментарий': 'Эти слова подчеркивают важность самопознания и внутренней силы в преодолении трудностей.'},
    'Жизнь коротка, искусство долго, возможность обманчива, опыт обманывающий, решение трудное.':
        {'автор': 'Сенека','комментарий': 'Сенека выражает сложность жизни и важность ценности времени и мудрости.'},
    'После дождя всегда светит солнце. Вам просто нужно продержаться до тех пор, пока это произойдет.':
        {'автор': 'Харуки Мураками','комментарий': 'Мураками подчеркивает важность надежды и терпения в трудных временах.'},
    'Любовь — это красивое приключение, где нет ни карты, ни компаса.':
        {'автор': 'Владимир Набоков','комментарий': 'Набоков описывает любовь как сложное и непредсказуемое путешествие.'},
    'Самый важный временной интервал — это сейчас.':
        {'автор': 'Лев Толстой','комментарий': 'Толстой призывает к осознанию настоящего момента и ценности текущего времени.'}}


if __name__ == '__main__':
    import random
    thought = random.choice(list(best_thoughts_west.keys()))
    output = (f'{thought}\n{"-" * 5}\nавтор: {best_thoughts_west[thought]["автор"]}\n'
              f'комментарий: {best_thoughts_west[thought]["комментарий"]}')
    print(output)
